Repository: scanmem/scanmem
Catalog: po/*.po
Languages: ka

source: GameConqueror - Memory Editor
ka: GameConqueror - მეხსიერების რედაქტორი

source: _Address:
ka: მის_ამართი:

source: Target address here (CTRL+L)
ka: სამიზნე მისამართი აქ (CTRL+L)

source: Enter address to view
ka: შეიყვანეთ მისამართი სანახავად

source: Jump to address (CTRL+ENTER)
ka: გადასვლა მისამართზე (CTRL+ ENTER)

source: _Refresh (CTRL+R)
ka: _განახლება (CTRL+R)

source: Found: 0
ka: მოიძებნა: 0

source: Syntax: For numeric types: <span font_family="monospace"> <b>N</b> Exactly this number <b>N..M</b> Range between two numbers <b>?</b> Unknown initial value <b>&gt; or +</b> Increased values <b>&lt; or -</b> Decreased values <b>=</b> Unchanged values <b>!=</b> Changed values <b>&gt; N</b> Greater than N <b>&lt; N</b> Less than N <b>+ N</b> Increased by N <b>- N</b> Decreased by N <b>!= N</b> Other than N </span> where N could be a number of a simple math expression embraced by (), e.g. <span font_family="monospace"> 12 0x34 5.67 (- 8 * 9)</span> For bytearray: use 2-char hexadecimal notation for each byte, separated by spaces e.g. <span font_family="monospace">FE DC BA 98 76 54 32 10</span> <span font_family="monospace">??</span> can be used as a wildcard value For string: enter the string directly
ka: სინტაქსი: რიცხვითი ტიპებისთვის: <span font_family="monospace"> <b>N</b> ზუსტად ეს რიცხვი <b>ნ.. M</b> დიაპაზონი ორ რიცხვს შორის <b>?</b> უცნობი საწყისი ღირებულება <b>&gt; ან +</b> გაზრდილი ღირებულებები <b>&lt; ან -</b> შემცირებული ღირებულებები <b>=</b> უცვლელი ღირებულებები <b>!=</b> შეცვლილი ღირებულებები <b>&gt; N</b> უფრო დიდი ვიდრე N <b>&lt; N</b> N-ზე ნაკლები <b>+ N</b> გაიზარდა N- ით <b>- N</b> N-ით შემცირდა <b>!= N</b> N-ის გარდა </span> სადაც N შეიძლება იყოს მრავალი მარტივი მათემატიკის გამოხატულება, რომელიც მიღებულია (), მაგალითად. <span font_family="monospace"> 12 0x34 5.67 (- 8 * 9)</span> bytearray: გამოიყენეთ 2-char hexadecimal ნოტაცია თითოეული byte, გამოყოფილი სივრცეები მაგ. <span font_family="monospace">FE DC BA 98 76 54 32 10</span> <span font_family="monospace">??</span> სტრიქონისთვის: პირდაპირ შეიყვანეთ სტრიქონი

source: _Value: <span color="blue"><u>?</u></span>
ka: _მნიშვნელობა: <span color="blue"><u>?</u></span>

source: Enter search value here (CTRL+K/L)
ka: შეიყვანეთ საძებნი მნიშვნელობა აქ (CTRL + K/ L)

source: Insert value to search for (CTRL+K/L)
ka: მნიშვნელობა მოსაძებნად (CTRL + K/L)

source: Scan (CTRL+ENTER)
ka: სკანირება (CTRL+ ENTER)

source: Reset (CTRL+R)
ka: გადატვირთვა (CTRL+R)

source: Stop scan
ka: ძებნის შეჩერება

source: About
ka: პროგრამის შესახებ

source: Select a process (CTRL+F)
ka: აირჩიეთ პროცესი (CTRL+F)

source: Select a process
ka: აირჩიეთ პროცესი

source: No process selected
ka: პროცესი არჩეული არაა

source: Specify type of target data
ka: მიუთითეთ სამიზნე მონაცემების ტიპი

source: Data _Type:
ka: მონაცემების _ტიპი:

source: <b>Basic:</b> Fastest but may miss some values <b>Normal:</b> Works for most cases <b>Full:</b> Never miss values but slowest
ka: <b>ძირითადი:</b> ყველაზე სწრაფი, მაგრამ შეიძლება გამოტოვოს რამდენიმე მნიშვნელობა <b>ნორმალური:</b> მუშაობს უმეტეს შემთხვევაში <b>სრული:</b> არასოდეს გამოტოვებს მნიშვნელობებს, მაგრამ ნელია

source: _Search Scope:
ka: _ძებნის დიაპაზონი:

source: Memory Editor (CTRL+SHIFT+M)
ka: მეხსიერების რედაქტორი (CTRL+SHIFT+M)

source: Save address list to file (CTRL+S)
ka: მისამართების სიის ფაილში შენახვა (CTRL+ S)

source: Load address list from file (CTRL+O)
ka: ჩატვირთეთ მისამართების სია ფაილიდან (CTRL+O)

source: Remove all entries (CTRL+D)
ka: ყველა ჩანაწერის წაშლა (CTRL+D)

source: Manually add an entry (CTRL+M)
ka: ჩანაწერის ხელით დამატება (CTRL+M)

source: Copyright (C) 2009-2014 WANG Lu <coolwanglu@gmail.com> Copyright (C) 2010 Bryan Cain Copyright (C) 2015-2016 Sebastian Parschauer <s.parschauer@gmx.de> Copyright (C) 2016 Andrea Stacchiotti <andreastacchiotti(a)gmail.com> Special thanks: Igor Gnatenko, Mattias Muenster, Zhang Zhe
ka: საავტორო უფლებები (C) 2009-2014 WANG Lu <coolwanglu@gmail.com> საავტორო უფლებები (C) 2010 ბრიან კაენი საავტორო უფლებები (C) 2015-2016 სებასტიან პარშაუერი <s.parschauer@gmx.de> საავტორო უფლებები (C) 2016 ანდრეა სტაჩიოტი <andreastacchiotti (a)gmail.com> განსაკუთრებული მადლობა: იგორ გნატენკო, მატიას მუენსტერი, ჟანგ ჟე

source: A graphical frontend of scanmem
ka: გრაფიკული წინაბოლო scanmem-სთვის

source: Manually add an entry
ka: ჩანაწერის ხელით დამატება

source: _Add
ka: _დამატება

source: _Close
ka: დახურვა

source: Memory address of the value
ka: მნიშვნელობის მეხსიერების მისამართი

source: Addres_s:
ka: _მისამართი:

source: Give a brief description of the value
ka: მნიშვნელობის მოკლე აღწერა

source: _Description:
ka: _აღწერა:

source: _Type:
ka: ტიპი:

source: Specify data length (string/bytearray only)
ka: მიუთითეთ მონაცემების სიგრძე (მხოლოდ სტრიქონისთვის/ბაიტების მასივისთვის)

source: _Length:
ka: სიგრძე:

source: Type to search for a process
ka: პროცესის მოსაძებნად აკრიფეთ

source: _OK
ka: კარგი

source: _Cancel
ka: &გაუქმება

source: _User:
ka: _მომხმარებელი:

source: _Process:
ka: _პროცესი:

source: Filter
ka: ფილტრი

source: Basic
ka: ძირითადი

source: Normal
ka: ნორმალური

source: ReadOnly
ka: მხოლოდწასაკითხად

source: Full
ka: მთლიანი

source: Address
ka: მისამართი

source: Value
ka: მნიშვნელობა

source: Offset
ka: წანაცვლება

source: Region Type
ka: რეგიონის ტიპი

source: Lock
ka: ჩაკეტვა

source: Description
ka: აღწერა

source: Type
ka: ტიპი

source: User
ka: მომხმარებელი

source: Process
ka: პროცესი

source: Add to cheat list
ka: მოტყუების სიაში დამატება

source: Browse this address
ka: ამ მისამართის დათვალიერება

source: Scan for this address
ka: ამ მისამართის სკანირება

source: Remove this match
ka: ამ დამთხვევის წაშლა

source: Copy address
ka: მისამართის კოპირება

source: Remove this entry
ka: ამ ჩანაწერის წაშლა

source: Please select a process
ka: გთხოვთ აირჩიოთ პროცესი

source: Invalid address
ka: არასწორი მისამართი

source: Please enter a valid address.
ka: შეიყვანეთ სწორი მისამართი.

source: No Description
ka: აღწერის გარეშე

source: Open..
ka: გახსნა..

source: Save..
ka: _შენახვა...

source: <unknown>
ka: <უცნობი>

source: Cannot read memory
ka: მეხსიერებიდან წაკითხვის შეცდომა

source: Unknown architecture, you may report to developers
ka: არქიტექტურა უცნობია. შეგიძლიათ, პროგრამისტებს დაუკავშირდეთ

source: Cannot retrieve memory maps of that process, maybe it has exited (crashed), or you don't have enough privileges
ka: პროცესის მეხსიერების რუკების მიღების შეცდომა. შეიძლება, ის ან დასრულდა (ავარიულად), ან საკმარისი პრივილეგიები არ გაგაჩნიათ

source: Address %x is not readable
ka: მისამართის %x ჩაწერადი არაა

source: Address %x is not valid
ka: მისამართი %x არასწორია

source: Cannot find a readable region
ka: წაკითხვადი რეგიონის მოძებნა შეუძლებელია

source: Found: %d
ka: მოიძებნა: %d

source: Version of scanmem mismatched, you may encounter problems. Please make sure you are using the same version of GameConqueror as scanmem.
ka: Scanmem-ის ვერსია არ ემთხვევა. შეიძლება პრობლემები შეგექმნათ. დარწმუნდით, რომ GameConqueror-ის და scanmem-ის იგივე ვერსიებს იყენებთ.

source: A GUI for scanmem, a game hacking tool
ka: ინტერფეისის წინაბოლო scanmem-სთვის.. ის თამაშის დასაჰაკი პროგრამაა

source: Report bugs to
ka: შეცდომების შესახებ მიწერეთ

source: prefill the search box
ka: ძებნის ზოლის წინასწარი შევსება

source: PID of the process
ka: პროცესის PID-ით

source: No value provided
ka: მნიშვნელობა მითითებული არაა

source: Bad value: %s
ka: არასწორი მნიშვნელობა: %s

source: Command "%s" is not valid for the first scan
ka: ბრძანება "%s" პირველი სკანირებისას არასწორია

source: %s is not an integer
ka: %s მთელი რიცხვი არაა

source: %s is too bulky for %s
ka: %s ძალიან დიდია %s-სთვის

source: Cannot locate item: %s
ka: ელემენტის აღმოჩენა შეუძლებელია: %s

source: A game hacking tool. A GUI front-end for scanmem.
ka: თამაშის დასაჰაკი პროგრამა. ინტერფეისის წინაბოლო scanmem-სთვის.

source: Run Game Conqueror
ka: Game Conqueror-ის გაშვება

source: Authentication is required to run Game Conqueror
ka: Game Conqueror-ის გასაშვებად ავთენტიკაცია გჭირდებათ

source: Game hacking tool. GUI front-end for scanmem.
ka: თამაშის დასაჰაკი პროგრამა. ინტერფეისის წინაბოლო scanmem-სთვის.

source: scanmem is a simple interactive debugging utility, used to locate the address of a variable in an executing process. This can be used for the analysis or modification of a hostile process on a compromised machine, reverse engineering, or as a "pokefinder" to cheat at video games. GameConqueror aims to provide a CheatEngine-alike interface for scanmem, it's user-friendly and easy to use.
ka: scanmem-ი მარტივი, ინტერაქტიური გამართვის პროგრამაა, რომელის გაშვებულ პროცესში მნიშვნელობის მისამართის მოსაძებნად შეგიძლიათ, გამოიყენოთ. ასევე შეგიძლიათ გატეხილ მანქანაზე მტრული პროცესის ანალიზისთვის თამაშებში "ჩიტებისთვის" და რევერსიული ინჟინერიისთვისაც გამოიყენოთ.

source: Features:
ka: თვისებები:

source: Locking on multiple variables
ka: ბევრ ცვლადის დაკვირვება

source: Memory Viewer/Editor
ka: მეხსიერების დათვალიერება/ჩასწორება

source: ... many to be done
ka: ... გასაკეთებელი კიდევ ბევრია
